var value = 12345.6789;

// ------------------------------------------------------------
// 指定桁数の精度に丸めた文字列に変換する（引数省略）
// ------------------------------------------------------------
console.log( value.toPrecision()   ); // "12345.6789"

// ------------------------------------------------------------
// 指定桁数の精度に丸めた文字列に変換する（引数指定）
// ------------------------------------------------------------
console.log( value.toPrecision(1)  ); // "1e+4"
console.log( value.toPrecision(3)  ); // "1.23e+4"
console.log( value.toPrecision(6)  ); // "12345.7"
console.log( value.toPrecision(9)  ); // "12345.6789"
console.log( value.toPrecision(12) ); // "12345.6789000"
console.log( value.toPrecision(15) ); // "12345.6789000000"
